"""
Задача №112567. Кубики

Привидение Петя любит играть со своими кубиками. Он любит выкладывать их в ряд и разглядывать свое творение.
Однако недавно друзья решили подшутить над Петей и поставили в его игровой комнате зеркало.
Ведь всем известно, что привидения не отражаются в зеркале! А кубики отражаются.
Теперь Петя видит перед собой N цветных кубиков, но не знает, какие из этих кубиков настоящие,
а какие — всего лишь отражение в зеркале.
Помогите Пете! Выясните, сколько кубиков может быть у Пети.
Петя видит отражение всех кубиков в зеркале и часть кубиков, которая находится перед ним.
Часть кубиков может быть позади Пети, их он не видит.


Входные данные

Первая строка входного файла содержит число N (1≤ N≤1000000) и количество различных цветов,
в которые могут быть раскрашены кубики — M (1≤M≤1000000).
Следующая строка содержит N целых чисел от 1 до M — цвета кубиков.

Выходные данные

Выведите в выходной файл все такие K, что у Пети может быть K кубиков.
"""