{
  "0 лабораторная": {
    "1 задание": "Напишите программу, чтобы она выводила текст на экран: Mesa called Jar Jar Binks, mesa your humble servant!",
    "2 задание": "Выведите на экран текст \"We have to get out of here. We need transport\".",
    "3 задание": "Вывести на экран текст \"Destroy Droidekas!\" 5 раз",
    "4 задание": "Вывести разницу между цифрами.",
    "5 задание": "Расставьте комментарии, чтобы получилось 12, 2",
    "6 задание": "Поставьте комментарий, чтобы вывести предложение.",
    "7 задание": "Объявите переменную jedi типа String. Сразу же в строке объявления присвойте ей какое-нибудь значение. Выведите на экран переменную jedi",
    "8 задание": "Напишите программу, которая выводит на экран квадрат этой переменной (number * number)",
    "9 задание": "Напишите программу, которая выводит на экран надпись: \"May the Force be with you\" 10 раз.",
    "10 задание": "Напишите программу, которая в методе main объявляет такие переменные: name типа String, height типа int и planet типа String.",
    "11 задание": "Внесите изменения в программу, чтобы переменная mol имела значение Mol",
    "12 задание": "Расставить знаки плюс и минус так, чтобы значение переменной result равнялось 20.",
    "13 задание": "Напишите программу, которая выводит на экран квадрат числа 5.",
    "14 задание": "Закомментируйте переменные, которые нигде не используются. Программа должна компилироваться.",
    "15 задание": "Вам предстоит написать метод print, который будет выводить на экран строку 4 раза. Строка — аргумент метода, то есть подаётся на входе.",
    "16 задание": "Напишите метод public static void increaseSpeed(int a), который будет принимать значение скорости n, увеличивать ее на 100 и выведите на экран надпись: \"Your speed is: <n+100> km/h.\"",
    "17 задание": "В методе main создайте объект Zam, сохраните ссылку на него в переменную zam. Создайте также объект Dron и сохраните ссылку на него в переменную dron.",
    "18 задание": "Создайте 3 джедая",
    "19 задание": "Создай 10 переменных типа Clone и 8 объектов типа Clone.",
    "20 задание": "Создайте объект типа Clone1, Clone2, Clone3 и объект типа Dias. Присвой каждому клону владельца (owner).",
    "21 задание": "Зная, что на планете Камино гравитация, как на Луне, реализуйте метод, который переводит земной вес в лунный. Реализуй метод getWeight(int), который принимает вес тела (в Ньютонах) на Земле, и возвращает, сколько это тело будет весить на Луне (в Ньютонах).  Тип возвращаемого значения - double.",
    "22 задание": "Давайте перешлем сообщение астродроиду в понятном ему формате. Для этого реализуем метод print3. Реализуйте метод print3. Метод должен вывести переданную строку (слово) на экран три раза через пробел.",
    "23 задание": "Увидев, что ракета попала по цели, Фетт улетает на планету Дженозис, вы же, успешно спрятавшись за астероидом затаились, чтобы выждать, когда наемник отлетит на минимальное безопасное расстояние, чтобы проследовать за ним. Напишите функцию, которая возвращает минимум из двух чисел."
  },
  "1 лабораторная": {
    "1 задание": "Вычислить z = Math.exp(Math.abs(max_x)) - Math.exp(Math.abs(max_y))) / Math.sqrt((Math.abs(max_x * max_y))) где - max_x наибольший элемент массива X(20); max_y - наибольший элемент массива Y(15). Для вычисления наибольшего элемента массива использовать функцию.",
    "2 задание": "Даны массивы действительных чисел А(20), B(15), C(10). Вычислить M = (S+T+K)/2, где S, T, K – суммы положительных элементов массивов А, В, С соответственно. Для вычисления суммы положительных элементов использовать функцию.",
    "3 задание": "Даны целые числа m, n. Вычислить с = m!/(n! * (m-n)!). Для вычисления факториала использовать функцию.\n",
    "4 задание": "Даны действительные х, у, z. Составить программу вычисления значения Math.sqrt(pow_x + pow_y + Math.pow(Math.sin(x * y), 2)) + Math.sqrt(pow_x + pow_z + Math.pow(Math.sin(x * z), 2)) + Math.sqrt(pow_z + pow_y + Math.pow(Math.sin(z * y), 2))",
    "5 задание": "Составить программу для вычисления среднего арифметического положительных элементов массивов Х(20), Y(15), Z(10), используя в качестве подпрограммы функцию.",
    "6 задание": "Даны массивы А(15), Y(15), C(12). Вычислить l = min(b_i) + min(c_i) if abs(min(a_i)) > 10 else 1 + min(abs(c_i))",
    "7 задание": "Дан массив D(40) вещественных чисел. Найти среднее геометрическое его элементов, которые удовлетворяют условию 0 < di < 12. Для вычислений использовать функцию.",
    "8 задание": "Дан массив А(80) целых чисел. Найти сумму и количество тех элементов массива, которые отрицательны и нечетны. Использовать в качестве подпрограммы процедуру",
    "9 задание": "Функция, вычисляющая среднее арифметическое элементов массива. Написать функцию, которая вычисляет среднее арифметическое элементов массива, переданного ей в качестве аргумента",
    "10 задание": "Отсортировать массив по возрастанию суммы цифр Дан одномерный массив, состоящий из натуральных чисел. Выполнить сортировку данного массива по возрастанию суммы цифр чисел. Например, дан массив чисел [14, 30, 103]. После сортировки он будет таким: [30, 103, 14], так как сумма цифр числа 30 составляет 3, числа 103 равна 4, числа 14 равна 5.",
    "11 задание": "Вывести на экран исходный массив, отсортированный массив, а также для контроля сумму цифр каждого числа отсортированного массива.",
    "12 задание": "Определить количество разрядов числа. Написать функцию, которая определяет количество разрядов введенного целого числа.",
    "13 задание": "Сумма ряда с факториалом. Вычислить сумму ряда",
    "14 задание": "Изменить порядок слов в строке на обратный. Вводится строка, состоящая из слов, разделенных пробелами. Следует заменить ее на строку, в которой слова идут в обратном порядке по сравнению с исходной строкой. Вывести измененную строку на экран.",
    "15 задание": "Функция бинарного поиска в массиве Пользователь вводит число. Сообщить, есть ли оно в массиве, элементы которого расположены по возрастанию значений, а также, если есть, в каком месте находится. При решении задачи использовать бинарный (двоичный) поиск, который оформить в виде отдельной функции.\n",
    "16 задание": "Вычисление наибольших общих делителей. Найти наибольшие общие делители (НОД) для множества пар чисел.",
    "17 задание": "Найти площади разных фигур. В зависимости от выбора пользователя вычислить площадь круга, прямоугольника или треугольника. Для вычисления площади каждой фигуры должна быть написана отдельная функция.",
    "18 задание": "Найти массив с максимальной суммой элементов. Сгенерировать десять массивов из случайных чисел. Вывести их и сумму их элементов на экран. Найти среди них один с максимальной суммой элементов. Указать какой он по счету, повторно вывести этот массив и сумму его элементов. Заполнение массива и подсчет суммы его элементов оформить в виде отдельной функции.",
    "19 задание": "Вычислить сумму элементов главной или побочной диагонали матрицы. Дана квадратная матрица. Вычислить сумму элементов главной или побочной диагонали в зависимости от выбора пользователя. Сумма элементов любой диагонали должна вычисляться в одной и той же функции.",
    "20 задание": "Функция перевода десятичного числа в двоичное. Переводить в двоичную систему счисления вводимые в десятичной системе счисления числа до тех пор, пока не будет введен 0. Для перевода десятичного числа в двоичное написать функцию.",
    "21 задание": "Вычислить значения функции y=f(x) на заданном диапазоне. Вычислить значения нижеприведенной функции в диапазоне значений x от -10 до 10 включительно с шагом, равным 1. y = x2 при -5 <= x <= 5; y = 2*|x|-1 при x < -5; y = 2x при x > 5. Вычисление значения функции оформить в виде программной функции, которая принимает значение x, а возвращает полученное значение функции (y).",
    "22 задание": "Функция заполнения массива случайными числами. Написать функцию, которая заполняет массив случайными числами в диапазоне, указанном пользователем. Функция должна принимать два аргумента - начало диапазона и его конец, при этом ничего не возвращать. Вывод значений элементов массива должен происходить в основной ветке программы.",
    "23 задание": "Написать функцию вычисления величины силы тока на участке электрической цепи сопротивлением R Ом при напряжении U В.\n",
    "24 задание": "Написать функцию вычисления напряжения на каждом из последовательно соединенных участков электрической цепи сопротивлением R1, R2, R3 Ом, если сила тока при напряжении U В составляет I А.",
    "25 задание": "Составить программу для ввода на экран номера дня недели и вывода соответствующего ему дня недели на русском языке."
  },
  "1.1 лабораторная": {
    "1 задание": "Ввести n строк с консоли, найти самую короткую строку. Вывести эту строку и ее длину",
    "2 задание": "Ввести n строк с консоли. Упорядочить и вывести строки в порядке возрастания их длин, а также (второй приоритет) значений этих их длин.",
    "3 задание": "Ввести n строк с консоли. Вывести на консоль те строки, длина которых меньше средней, также их длины.",
    "4 задание": "В каждом слове текста k-ю букву заменить заданным символом. Если k больше длины слова, корректировку не выполнять.",
    "5 задание": "В русском тексте каждую букву заменить ее номером в алфавите. В одной строке печатать текст с двумя пробелами между буквами, в следующей строке внизу под каждой буквой печатать ее номер.",
    "6 задание": "Из небольшого текста удалить все символы, кроме пробелов, не являющиеся буквами. Между последовательностями подряд идущих букв оставить хотя бы один пробел.",
    "7 задание": "Из текста удалить все слова заданной длины, начинающиеся на согласную букву.",
    "8 задание": "В тексте найти все пары слов, из которых одно является обращением другого.",
    "9 задание": "Найти и напечатать, сколько раз повторяется в тексте каждое слово.",
    "10 задание": "Найти, каких букв, гласных или согласных, больше в каждом предложении текста.\n",
    "11 задание": "Выбрать три разные точки заданного на плоскости множества точек, составляющие треугольник наибольшего периметра.",
    "12 задание": "Найти такую точку заданного на плоскости множества точек, сумма расстояний от которой до остальных минимальна.\n",
    "13 задание": "Выпуклый многоугольник задан на плоскости перечислением координат вершин в порядке обхода его границы. Определить площадь многоугольника."
  },
  "2 лабораторная": {
    "1 задание": "Расставьте правильно операторы приведения типа, чтобы получился ответ: d = 3.765. Операторы — в условии.",
    "2 задание": "Давайте тоже найдем решение задачи: у нас есть какие-то переменные, преобразованные в другой тип, но их недостаточно. Нужно добавить одну операцию по преобразованию типа, чтобы получался нужный нам ответ b = 0.",
    "3 задание": "Даны short number = 9, char zero = ‘0’ и int nine = (zero + number). Добавьте одну операцию по преобразованию типа, чтобы получился красивый правильный ответ: 9.",
    "4 задание": "Уберите ненужные операторы приведения типа, чтобы получился ответ: result: 1000.0",
    "5 задание": "Уберите ненужные операторы приведения типа, чтобы получился ответ: 1234567.",
    "6 задание": "Нужно добавить одну операцию по преобразованию типа, чтобы получался ответ: d = 2.941. Пример вывода: 2.9411764705882355",
    "7 задание": "Нужно добавить одну операцию по преобразованию типа, чтобы получался ответ: d = 1.0",
    "8 задание": "Вам надо добавить одну операцию по преобразованию типа, чтобы получался ответ: d = 5.5."
  },
  "3 лабораторная": {
    "1 задание": "Ввести n строк с консоли, найти самую короткую и самую длинную строки. Вывести найденные строки и их длину.",
    "2 задание": "Ввести n строк с консоли. Упорядочить и вывести строки в порядке возрастания (убывания) значений их длины.",
    "3 задание": "Ввести n строк с консоли. Вывести на консоль те строки, длина которых меньше (больше) средней, а также длину.",
    "4 задание": "Ввести n слов с консоли. Найти слово, в котором число различных символов минимально. Если таких слов несколько, найти первое из них.",
    "5 задание": "Ввести n слов с консоли. Найти количество слов, содержащих только символы латинского алфавита, а среди них – количество слов с равным числом гласных и согласных букв.",
    "6 задание": "Ввести n слов с консоли. Найти слово, символы в котором идут в строгом порядке возрастания их кодов. Если таких слов несколько, найти первое из них.",
    "7 задание": "Ввести n слов с консоли. Найти слово, состоящее только из различных символов. Если таких слов несколько, найти первое из них.",
    "8 задание": "Ввести n слов с консоли. Среди слов, состоящих только из цифр, найти слово-палиндром. Если таких слов больше одного, найти второе из них.",
    "9 задание": "Написать программы решения задач 1–8, осуществляя ввод строк как аргументов командной строки.",
    "10 задание": "Введите одно из заданий, которые представлены ниже.\nА) Напишите метод, который принимает в качестве параметра любую строку, например “I like Java!!!”.\n Б) Распечатать последний символ строки. Используем метод String.charAt().\nВ) Проверить, заканчивается ли ваша строка подстрокой “!!!”. Используем метод String.endsWith().\nГ) Проверить, начинается ли ваша строка подстрокой “I like”. Используем метод String.startsWith().\nД) Проверить, содержит ли ваша строка подстроку “Java”. Используем метод String.contains().\nЕ) Найти позицию подстроки “Java” в строке “I like Java!!!”.\nЖ) Заменить все символы “а” на “о”.\nЗ) Преобразуйте строку к верхнему регистру.\nИ) Преобразуйте строку к нижнему регистру.\nК) Вырезать строку Java c помощью метода String.substring().",
    "11 задание": "А) Дано два числа, например 3 и 56, необходимо составить следующие строки: 3 + 56 = 59 3 – 56 = -53 3 * 56 = 168. Используем метод StringBuilder.append().\nБ) Замените символ “=” на слово “равно”. Используйте методы StringBuilder.insert(), StringBuilder.deleteCharAt().\nВ) Замените символ “=” на слово “равно”. Используйте методы StringBuilder.replace().",
    "12 задание": "Напишите метод, заменяющий в строке каждое второе вхождение «object-oriented programming» (не учитываем регистр символов) на «OOP». Например, строка \"Object-oriented programming is a programming language model organized around objects rather than \"actions\" and data rather than logic. Object-oriented programming blabla. Object-oriented programming bla.\"должна быть преобразована в \"Object-oriented programming is a programming language model organized around objects rather than \"actions\" and data rather than logic. OOP blabla.Object-oriented programming bla.\"",
    "13 задание": "Даны строки разной длины (длина - четное число), необходимо вернуть ее два средних знака: \"string\" → \"ri\", \"code\" → \"od\", \"Practice\"→\"ct\".",
    "14 задание": "Создать строку, используя форматирование: Студент [Фамилия] получил [оценка] по [предмету]. Форматирование и вывод строки на консоль написать в отдельном методе, который принимает фамилию, оценку и название предмета в качестве параметров. Выделить под фамилию 15 символов, под оценку 3 символа, предмет – 10.",
    "15 задание": "Дана строка “Versions: Java 5, Java 6, Java 7, Java 8, Java 12.”. Найти все подстроки \"Java X\" и распечатать их.",
    "16 задание": "Найти слово, в котором число различных символов минимально. Слово может содержать буквы и цифры. Если таких слов несколько, найти первое из них. Например, в строке \"fffff ab f 1234 jkjk\" найденное слово должно быть \"fffff\".",
    "17 задание": "Предложение состоит из нескольких слов, разделенных пробелами. Например: \"One two three раз два три one1 two2 123 \". Найти количество слов, содержащих только символы латинского алфавита.",
    "18 задание": "Предложение состоит из нескольких слов, например: \"Если есть хвосты по дз, начните с 1 не сданного задания. 123 324 111 4554\". Среди слов, состоящих только из цифр, найти слово палиндром.\n"
  },
  "3.1 лабораторная": {
    "1 задание": "Написать регулярное выражение, определяющее является ли данная строка строкой \"abcdefghijklmnopqrstuv18340\" или нет. – пример правильных выражений: abcdefghijklmnopqrstuv18340. – пример неправильных выражений: abcdefghijklmnoasdfasdpqrstuv18340.",
    "2 задание": "Написать регулярное выражение, определяющее является ли данная строка GUID с или без скобок. Где GUID это строчка, состоящая из 8, 4, 4, 4, 12 шестнадцатеричных цифр разделенных тире. – пример правильных выражений: e02fd0e4-00fd-090A-ca30-0d00a0038ba0. – пример неправильных выражений: e02fd0e400fd090Aca300d00a0038ba0.",
    "3 задание": "Написать регулярное выражение, определяющее является ли заданная строка правильным MAC-адресом. – пример правильных выражений: aE:dC:cA:56:76:54. – пример неправильных выражений: 01:23:45:67:89:Az.",
    "4 задание": "Написать регулярное выражение, определяющее является ли данная строчка валидным URL адресом. В данной задаче правильным URL считаются адреса http и https, явное указание протокола также может отсутствовать. Учитываются только адреса, состоящие из символов, т.е. IP адреса в качестве URL не присутствуют при проверке. Допускаются поддомены, указание порта доступа через двоеточие, GET запросы с передачей параметров, доступ к подпапкам на домене, допускается наличие якоря через решетку. Однобуквенные домены считаются запрещенными. Запрещены спецсимволы, например «–» в начале и конце имени домена. Запрещен символ «_» и пробел в имени домена. При составлении регулярного выражения ориентируйтесь на список правильных и неправильных выражений заданных ниже. – пример правильных выражений: http://www.example.com, http://example.com. – пример неправильных выражений: Just Text, http://a.com.",
    "5 задание": "Написать регулярное выражение, определяющее является ли данная строчка шестнадцатиричным идентификатором цвета в HTML. Где #FFFFFF для белого, #000000 для черного, #FF0000 для красного и т.д. – пример правильных выражений: #FFFFFF, #FF3421, #00ff00. – пример неправильных выражений: 232323, f#fddee, #fd2.",
    "6 задание": "Написать регулярное выражение, определяющее является ли данная строчка датой в формате dd/mm/yyyy. Начиная с 1600 года до 9999 года. – пример правильных выражений: 29/02/2000, 30/04/2003, 01/01/2003. – пример неправильных выражений: 29/02/2001, 30-04-2003, 1/1/1899.",
    "7 задание": "Написать регулярное выражение, определяющее является ли данная строчка валидным E-mail адресом согласно RFC под номером 2822. – пример правильных выражений: user@example.com, root@localhost – пример неправильных выражений: bug@@@com.ru, @val.ru, Just Text2.",
    "8 задание": "Составить регулярное выражение, определяющее является ли заданная строка IP адресом, записанным в десятичном виде. – пример правильных выражений: 127.0.0.1, 255.255.255.0. – пример неправильных выражений: 1300.6.7.8, abc.def.gha.bcd.",
    "9 задание": "Проверить, надежно ли составлен пароль. Пароль считается надежным, если он состоит из 8 или более символов. Где символом может быть английская буква, цифра и знак подчеркивания. Пароль должен содержать хотя бы одну заглавную букву, одну маленькую букву и одну цифру. – пример правильных выражений: C00l_Pass, SupperPas1. – пример неправильных выражений: Cool_pass, C00l.",
    "10 задание": "Проверить является ли заданная строка шестизначным числом, записанным в десятичной системе счисления без нулей в старших разрядах. – пример правильных выражений: 123456, 234567. – пример неправильных выражений: 1234567, 12345.",
    "11 задание": "Есть текст со списками цен. Извлечь из него цены в USD, RUR, EU. – пример правильных выражений: 23.78 USD. – пример неправильных выражений: 22 UDD, 0.002 USD.",
    "12 задание": "Проверить существуют ли в тексте цифры, за которыми не стоит «+». – пример правильных выражений: (3 + 5) – 9 × 4. – пример неправильных выражений: 2 * 9 – 6 × 5.",
    "13 задание": "Создать запрос для вывода только правильно написанных выражений со скобками (количество открытых и закрытых скобок должно быть одинаково). – пример правильных выражений: (3 + 5) – 9 × 4. – пример неправильных выражений: ((3 + 5) – 9 × 4"
  },
  "4 лабораторная": {
    "1 задание": "Инициализация односвязного списка",
    "2 задание": "Добавление элемента в начало односвязного списка",
    "3 задание": "Добавление элемента в конец односвязного списка",
    "4 задание": "Показ всех элементов односвязного списка",
    "5 задание": "Удаление всех элементов односвязного списка",
    "6 задание": "Определение количества элементов односвязного списка",
    "7 задание": "Проверка односвязного списка на пустоту",
    "8 задание": "Удаление первого элемента односвязного списка",
    "9 задание": "Удаление последнего элемента односвязного списка",
    "10 задание": "Поиск данного значения в односвязном списке",
    "11 задание": "Поиск наибольшего и наименьшего значений в односвязном списке",
    "12 задание": "Удаление элемента из односвязного списка с данным значением",
    "13 задание": "Удаление всех элементов односвязного списка с данным значением",
    "14 задание": "Изменение всех элементов односвязного списка с данным значением на новое.",
    "15 задание": "Определение, является ли односвязного список симметричным.",
    "16 задание": "Определение, можно ли удалить из односвязного списка каких-нибудь два элемента так, чтобы новый список оказался упорядоченным.",
    "17 задание": "Определение, сколько различных значений содержится в односвязном списке.",
    "18 задание": "Удаление из односвязного списка элементов, значения которых уже встречались в предыдущих элементах.",
    "19 задание": "Изменение порядка элементов односвязного списка на обратный.",
    "20 задание": "Сортировка элементов односвязного списка двумя способами (изменение указателей, изменение значений элементов)",
    "21 задание": "Инициализация двусвязного списка",
    "22 задание": "Добавление элемента в начало двусвязного списка",
    "23 задание": "Добавление элемента в конец двусвязного списка",
    "24 задание": "Показ всех элементов двусвязного списка",
    "25 задание": "Удаление всех элементов двусвязного списка",
    "26 задание": "Определение количества элементов двусвязного списка",
    "27 задание": "Проверка двусвязного списка на пустоту",
    "28 задание": "Удаление первого элемента односвязного списка",
    "29 задание": "Удаление последнего элемента двусвязного списка",
    "30 задание": "Поиск данного значения в двусвязном списке",
    "31 задание": "Поиск наибольшего и наименьшего значений в двусвязного списке",
    "32 задание": "Удаление элемента из двусвязного списка с данным значением",
    "33 задание": "Удаление всех элементов двусвязного списка с данным значением",
    "34 задание": "Изменение всех элементов двусвязного списка с данным значением на новое.",
    "35 задание": "Определение, является ли двусвязный список симметричным.",
    "36 задание": "Определение, можно ли удалить из двусвязного списка каких-нибудь два элемента так, чтобы новый список оказался упорядоченным.",
    "37 задание": "Определение, сколько различных значений содержится в двусвязном списке.",
    "38 задание": "Удаление из двусвязного списка элементов, значения которых уже встречались в предыдущих элементах.",
    "39 задание": "Изменение порядка элементов односвязного списка на обратный.",
    "40 задание": "Сортировка элементов односвязного списка двумя способами (изменение указателей, изменение значений элементов)",
    "41 задание": "Дан упорядоченный список книг. Добавить новую книгу, сохранив упорядоченность списка.",
    "42 задание": "Даны два упорядоченных по возрастанию списка. Объедините их в новый упорядоченный по возрастанию список.",
    "43 задание": "Дан список целых чисел. Упорядочьте по возрастанию только: а) положительные числа; б) элементы с четными порядковыми номерами в списке.",
    "44 задание": "Даны два списка. Определите, совпадают ли множества их элементов.",
    "45 задание": "Дан список. После каждого элемента добавьте предшествующую ему часть списка.",
    "46 задание": "Пусть элементы списка хранят символы предложения. Замените каждое вхождение слова \"itmathrepetitor\" на \"silence\".",
    "47 задание": "Дан текстовый файл. Создайте двусвязный список, каждый элемент которого содержит количество символов в соответствующей строке текста.",
    "48 задание": "Создайте двусвязный список групп факультета. Каждая группа представляет собой односвязный список студентов.",
    "49 задание": "Дан список студентов. Элемент списка содержит фамилию, имя, отчество, год рождения, курс, номер группы, оценки по пяти предметам. Упорядочите студентов по курсу, причем студенты одного курса располагались в алфавитном порядке. Найдите средний балл каждой группы по каждому предмету. Определите самого старшего студента и самого младшего студентов. Для каждой группы найдите лучшего с точки зрения успеваемости студента."
  }
}