{
  "0 лабораторная": {
    "1 задание": "Напишите программу, чтобы она выводила текст на экран: Mesa called Jar Jar Binks, mesa your humble servant!",
    "2 задание": "Выведите на экран текст \"We have to get out of here. We need transport\".",
    "3 задание": "Вывести на экран текст \"Destroy Droidekas!\" 5 раз",
    "4 задание": "Вывести разницу между цифрами.",
    "5 задание": "Расставьте комментарии, чтобы получилось 12, 2",
    "6 задание": "Поставьте комментарий, чтобы вывести предложение.",
    "7 задание": "Объявите переменную jedi типа String. Сразу же в строке объявления присвойте ей какое-нибудь значение. Выведите на экран переменную jedi",
    "8 задание": "Напишите программу, которая выводит на экран квадрат этой переменной (number * number)",
    "9 задание": "Напишите программу, которая выводит на экран надпись: \"May the Force be with you\" 10 раз.",
    "10 задание": "Напишите программу, которая в методе main объявляет такие переменные: name типа String, height типа int и planet типа String.",
    "11 задание": "Внесите изменения в программу, чтобы переменная mol имела значение Mol",
    "12 задание": "Расставить знаки плюс и минус так, чтобы значение переменной result равнялось 20.",
    "13 задание": "Напишите программу, которая выводит на экран квадрат числа 5.",
    "14 задание": "Закомментируйте переменные, которые нигде не используются. Программа должна компилироваться.",
    "15 задание": "Вам предстоит написать метод print, который будет выводить на экран строку 4 раза. Строка — аргумент метода, то есть подаётся на входе.",
    "16 задание": "Напишите метод public static void increaseSpeed(int a), который будет принимать значение скорости n, увеличивать ее на 100 и выведите на экран надпись: \"Your speed is: <n+100> km/h.\"",
    "17 задание": "В методе main создайте объект Zam, сохраните ссылку на него в переменную zam. Создайте также объект Dron и сохраните ссылку на него в переменную dron.",
    "18 задание": "Создайте 3 джедая",
    "19 задание": "Создай 10 переменных типа Clone и 8 объектов типа Clone.",
    "20 задание": "Создайте объект типа Clone1, Clone2, Clone3 и объект типа Dias. Присвой каждому клону владельца (owner).",
    "21 задание": "Зная, что на планете Камино гравитация, как на Луне, реализуйте метод, который переводит земной вес в лунный. Реализуй метод getWeight(int), который принимает вес тела (в Ньютонах) на Земле, и возвращает, сколько это тело будет весить на Луне (в Ньютонах).  Тип возвращаемого значения - double.",
    "22 задание": "Давайте перешлем сообщение астродроиду в понятном ему формате. Для этого реализуем метод print3. Реализуйте метод print3. Метод должен вывести переданную строку (слово) на экран три раза через пробел.",
    "23 задание": "Увидев, что ракета попала по цели, Фетт улетает на планету Дженозис, вы же, успешно спрятавшись за астероидом затаились, чтобы выждать, когда наемник отлетит на минимальное безопасное расстояние, чтобы проследовать за ним. Напишите функцию, которая возвращает минимум из двух чисел."
  },

  "1 лабораторная": {
    "1 задание": "Вычислить z = Math.exp(Math.abs(max_x)) - Math.exp(Math.abs(max_y))) / Math.sqrt((Math.abs(max_x * max_y))) где - max_x наибольший элемент массива X(20); max_y - наибольший элемент массива Y(15). Для вычисления наибольшего элемента массива использовать функцию.",
    "2 задание": "Даны массивы действительных чисел А(20), B(15), C(10). Вычислить M = (S+T+K)/2, где S, T, K – суммы положительных элементов массивов А, В, С соответственно. Для вычисления суммы положительных элементов использовать функцию.",
    "3 задание": "Даны целые числа m, n. Вычислить с = m!/(n! * (m-n)!). Для вычисления факториала использовать функцию.\n",
    "4 задание": "Даны действительные х, у, z. Составить программу вычисления значения Math.sqrt(pow_x + pow_y + Math.pow(Math.sin(x * y), 2)) + Math.sqrt(pow_x + pow_z + Math.pow(Math.sin(x * z), 2)) + Math.sqrt(pow_z + pow_y + Math.pow(Math.sin(z * y), 2))",
    "5 задание": "Составить программу для вычисления среднего арифметического положительных элементов массивов Х(20), Y(15), Z(10), используя в качестве подпрограммы функцию.",
    "6 задание": "Даны массивы А(15), Y(15), C(12). Вычислить l = min(b_i) + min(c_i) if abs(min(a_i)) > 10 else 1 + min(abs(c_i))",
    "7 задание": "Дан массив D(40) вещественных чисел. Найти среднее геометрическое его элементов, которые удовлетворяют условию 0 < di < 12. Для вычислений использовать функцию.",
    "8 задание": "Дан массив А(80) целых чисел. Найти сумму и количество тех элементов массива, которые отрицательны и нечетны. Использовать в качестве подпрограммы процедуру",
    "9 задание": "Функция, вычисляющая среднее арифметическое элементов массива. Написать функцию, которая вычисляет среднее арифметическое элементов массива, переданного ей в качестве аргумента",
    "10 задание": "Отсортировать массив по возрастанию суммы цифр Дан одномерный массив, состоящий из натуральных чисел. Выполнить сортировку данного массива по возрастанию суммы цифр чисел. Например, дан массив чисел [14, 30, 103]. После сортировки он будет таким: [30, 103, 14], так как сумма цифр числа 30 составляет 3, числа 103 равна 4, числа 14 равна 5.",
    "11 задание": "Вывести на экран исходный массив, отсортированный массив, а также для контроля сумму цифр каждого числа отсортированного массива.",
    "12 задание": "Определить количество разрядов числа. Написать функцию, которая определяет количество разрядов введенного целого числа.",
    "13 задание": "Сумма ряда с факториалом. Вычислить сумму ряда",
    "14 задание": "Изменить порядок слов в строке на обратный. Вводится строка, состоящая из слов, разделенных пробелами. Следует заменить ее на строку, в которой слова идут в обратном порядке по сравнению с исходной строкой. Вывести измененную строку на экран.",
    "15 задание": "Функция бинарного поиска в массиве Пользователь вводит число. Сообщить, есть ли оно в массиве, элементы которого расположены по возрастанию значений, а также, если есть, в каком месте находится. При решении задачи использовать бинарный (двоичный) поиск, который оформить в виде отдельной функции.\n",
    "16 задание": "Вычисление наибольших общих делителей. Найти наибольшие общие делители (НОД) для множества пар чисел.",
    "17 задание": "Найти площади разных фигур. В зависимости от выбора пользователя вычислить площадь круга, прямоугольника или треугольника. Для вычисления площади каждой фигуры должна быть написана отдельная функция.",
    "18 задание": "Найти массив с максимальной суммой элементов. Сгенерировать десять массивов из случайных чисел. Вывести их и сумму их элементов на экран. Найти среди них один с максимальной суммой элементов. Указать какой он по счету, повторно вывести этот массив и сумму его элементов. Заполнение массива и подсчет суммы его элементов оформить в виде отдельной функции.",
    "19 задание": "Вычислить сумму элементов главной или побочной диагонали матрицы. Дана квадратная матрица. Вычислить сумму элементов главной или побочной диагонали в зависимости от выбора пользователя. Сумма элементов любой диагонали должна вычисляться в одной и той же функции.",
    "20 задание": "Функция перевода десятичного числа в двоичное. Переводить в двоичную систему счисления вводимые в десятичной системе счисления числа до тех пор, пока не будет введен 0. Для перевода десятичного числа в двоичное написать функцию.",
    "21 задание": "Вычислить значения функции y=f(x) на заданном диапазоне. Вычислить значения нижеприведенной функции в диапазоне значений x от -10 до 10 включительно с шагом, равным 1. y = x2 при -5 <= x <= 5; y = 2*|x|-1 при x < -5; y = 2x при x > 5. Вычисление значения функции оформить в виде программной функции, которая принимает значение x, а возвращает полученное значение функции (y).",
    "22 задание": "Функция заполнения массива случайными числами. Написать функцию, которая заполняет массив случайными числами в диапазоне, указанном пользователем. Функция должна принимать два аргумента - начало диапазона и его конец, при этом ничего не возвращать. Вывод значений элементов массива должен происходить в основной ветке программы.",
    "23 задание": "Написать функцию вычисления величины силы тока на участке электрической цепи сопротивлением R Ом при напряжении U В.\n",
    "24 задание": "Написать функцию вычисления напряжения на каждом из последовательно соединенных участков электрической цепи сопротивлением R1, R2, R3 Ом, если сила тока при напряжении U В составляет I А.",
    "25 задание": "Составить программу для ввода на экран номера дня недели и вывода соответствующего ему дня недели на русском языке."
  },

  "1.1 лабораторная": {
    "1 задание": ""
  }
}