hello = Приветствую, <b>{ $username }</b>! Этот предназачен для курсовой работы по предмету Теория кодирования, сжатия и восстановления информации. Напишите нам свой пароль. Для начала вам нужно зарегистрироваться. Введие пароль в сообщении. Этот пароль будет использоваться в дальнейшем для аутентификации через сторонние сервисы.
request_password = Напишите нам свой пароль. Этот пароль будет использоваться в дальнейшем для аутентификации через сторонние сервисы.
success_register = Вы успешно зарегестрировались! Нажмите /help, чтобы узнать возможные команды
request_link_telegram_account = Нажмите на кнопку ниже, чтобы привязать свой телеграмм аккаунт
link_telegram_account = Привязать аккаунт

