hello = Приветствую, <b>{ $username }</b>! Этот предназачен для курсовой работы по предмету Теория кодирования, сжатия и восстановления информации. Напишите нам свой пароль. Для начала вам нужно зарегистрироваться. Введие пароль в сообщении. Этот пароль будет использоваться в дальнейшем для аутентификации через сторонние сервисы.
request_password = Напишите нам свой пароль. Этот пароль будет использоваться в дальнейшем для аутентификации через сторонние сервисы.
sucess_registrartion = Вы успешно зарегестрировались! Нажмите /help, чтобы узнать возможные команды

