"""
Задача №111240. Переворот

Дан массив. Надо научиться обрабатывать два типа запросов.

* 1 L R - перевернуть отрезок [L,R]

* 2 L R - найти минимум на отрезке [L,R]

Входные данные

Первая строка файла содержит два числа n, m. (1≤n,m≤10^5).
Во второй строке находится n чисел ai (1≤ai≤10^9) — исходный массив.
Остальные m строк содержат запросы, в формате описанном в условии.
Для чисел L, R выполняется ограничение (1≤L≤R≤n).

Выходные данные

На каждый запрос типа 2, во входной файл выведите ответ на него, в отдельной строке.
"""