image-bot-mode =
    📝 Режим художника-бота активирован!
    В этом разделе собраны AI-инструменты для редактирования и стилизации изображений
    Теперь все ваши картинки будут обрабатываться ИИ
    Для выхода используйте `/cancel`

gray-to-color = Перевести из серого в цветное

color-to-gray = Перевести из цветного в серое

rotate-angle = Повернуть изображения на сколько-то градусов

crop = Уменьшить размеры изображения

send-image-for-processing = 📷 Пришли изображение для обработки

image-processing = Фото получено. Обрабатываем...

image-metadata = Получить метаданные изображения

choose-action = Выберите одно из предложенных действий ниже

image-metadata = Получить метаданные изображения

