hello =
    Привет! Этот бот открывает вам доступ к нейросетям для создания текста, изображений, видео и песен.
    Данный бот является проектом по предмету "Машинное обучение".

    Здесь доступны новые модели: OpenAI o1, Deepseek. Также некоторые пользовательские модели.

    Чатбот умеет:
    1. Писать и переводить тексты
    2. Создавать изображения и видео
    3. Работать с документами
    4. Писать и редактировать код
    5. Решать задачи по математике
    6. Создавать оригинальные песни
    7. Редактировать фото

    📝 ТЕКСТ: просто напишите вопрос в чат (выбор нейросети в разделе /model).

    • /s + вопрос – умный поиск в Интернете через Perplexity и DeepSeek.

    🌅 ИЗОБРАЖЕНИЯ: введите команду и описание:
    • /imagine – команда для Midjourney

    🖌 ФОТО-РЕДАКТОР: нажмите /photo, чтобы открыть сервисы замены лиц, генерации аватарок и улучшения фото.

help =
    📝 Генерация текстов
    Для генерации текста напишите запрос в чат. Пользователи с подпиской /premium могут отправлять голосовые сообщения.

    /s и вопрос – Интернет-поиск с Perplexity
    /settings – настройки бота и выбор модели ChatGPT / Claude / Gemini / DeepSeek
     └ Памятка (https://teletype.in/@gpt4telegrambot/prompt) как писать запросы

    💬 Поддержка контекста
    По умолчанию бот запоминает контекст. При подготовке ответа он учитывает не только ваш текущий запрос, но и свой предыдущий ответ. Это позволяет вести диалог и задавать уточняющие вопросы. Чтобы начать диалог без учета контекста, используйте команду /deletecontext

    📄 Работа с документами
    При покупке запросов Claude доступна работа с документами. Можно загрузить текстовый файл, таблицу или презентацию до 10 MB в форматах: docx, pdf, xlsx, xls, csv, pptx, txt и задавать вопросы по документу. Запрос расходует 3 генерации Claude.

    🌅 Генерация изображений
    В боте подключены последние версии Midjourney, Flux и DALL•E 3

    /flux и краткое описание – генерация изображения Flux
    /dalle и краткое описание – генерация изображения DALL•E 3
    /imagine или /i и краткое описание – генерация изображения Midjourney
    /photo – запуск фото-редактора
    /Midjourney – описание основного функционала генерации изображений
    └ Памятка (https://teletype.in/@gpt4telegrambot/mastering_midjourney) по работе с Midjourney

    ⚙️ Другие команды
    /start – описание бота
    /account – ваш профиль и баланс

    По всем вопросам также можно написать администратору @computerScienceEnjoyer